In [4]:
# import des librairies dont nous aurons besoin
import pandas as pd
import numpy as np
import re

# chargement et affichage des données
data = pd.read_csv('D:\Dev\Mes fichiers Python\Fichiers de données\operations.csv')
data.head()

,date_operation,libelle,montant,solde_avt_ope,categ
0,2023-03-31,DON XX XX XX XX XX XX XX,-1.44,1515.25,AUTRE
1,2023-04-03,CARTE XX XX RAPT XX,-24.00,1513.81,TRANSPORT
2,2023-04-03,CARTE XX XX RAPT XX,-73.00,1489.81,TRANSPORT
3,2023-04-03,VIREMENT XX XX XX XX XX XX XX XX XX XX XX XX,676.00,1416.81,AUTRE
4,2023-04-03,VIREMENT XX XX XX XX XX XX,4.80,2092.81,AUTRE

In [2]:
data[data.isnull().any(axis=1)]

,date_operation,libelle,montant,solde_avt_ope,categ
107,2023-06-12,CARTE XX XX LES ANCIENS ROBINSON XX,NaN,4667.19,COURSES
156,2023-07-06,PRELEVEMENT XX TELEPHONE XX XX,-36.48,3295.68,NaN
269,2023-09-11,CARTE XX XX XX XX,NaN,3401.93,AUTRE

In [4]:
data['categ'].unique()

array(['AUTRE', 'TRANSPORT', 'FACTURE TELEPHONE', 'COURSES',
       'COTISATION BANCAIRE', 'RESTAURANT', 'LOYER', nan], dtype=object)

In [5]:
CATEG_VALUES = ['AUTRE', 'TRANSPORT', 'FACTURE TELEPHONE', 'COURSES',
       'COTISATION BANCAIRE', 'RESTAURANT', 'LOYER']

def process(value):

    if value not in CATEG_VALUES:

        return 'AUTRE'

    else:

        return value


data["categ"] = data["categ"].map(process)

In [6]:
data[data.isnull().any(axis=1)]

,date_operation,libelle,montant,solde_avt_ope,categ
107,2023-06-12,CARTE XX XX LES ANCIENS ROBINSON XX,NaN,4667.19,COURSES
269,2023-09-11,CARTE XX XX XX XX,NaN,3401.93,AUTRE

In [8]:
data.describe()

            montant  solde_avt_ope
count    307.000000     309.000000
mean     -45.911889    3396.117799
std      874.240605     666.180280
min   -15000.000000    1416.810000
25%      -20.495000    3010.760000
50%       -9.600000    3453.960000
75%       -2.710000    3783.860000
max     1071.600000    4709.310000

In [10]:
data['date_operation'] = pd.to_datetime(data['date_operation'], errors='coerce')
data[data.isnull().any(axis=1)]

,date_operation,libelle,montant,solde_avt_ope,categ
107,2023-06-12,CARTE XX XX LES ANCIENS ROBINSON XX,NaN,4667.19,COURSES
269,2023-09-11,CARTE XX XX XX XX,NaN,3401.93,AUTRE

In [26]:
data.iloc[107,2]=(data.iloc[108,3])-(data.iloc[107,3])

In [27]:
data.iloc[107,2]

-26.579999999999927

In [28]:
data.iloc[269,2]=(data.iloc[270,3])-(data.iloc[269,3])

In [29]:
data.iloc[269,2]

-12.0

In [ ]:
# Correction pour modifier les montants nuls avec une boucle 
# on stocke le df des valeurs manquantes dans un nouveau df
data_na = data.loc[data['montant'].isnull(),:]

# pour chaque ligne de mon df, on récupère les index (qui ne changent pas au travers du .loc)
# boucle sur index !!!
for index in data_na.index:
    # calcul du montant à partir des soldes précédents et actuels
    data.loc[index, 'montant'] = data.loc[index+1, 'solde_avt_ope'] - data.loc[index, 'solde_avt_ope']

In [6]:
# Condition pour avoir les valeurs nulles dans une colonnes 
data.loc[data['montant'].isnull(),:]

,date_operation,libelle,montant,solde_avt_ope,categ
107,2023-06-12,CARTE XX XX LES ANCIENS ROBINSON XX,NaN,4667.19,COURSES
269,2023-09-11,CARTE XX XX XX XX,NaN,3401.93,AUTRE

In [7]:
# Renvoie toutes les lignes avec au moins un élément nul --> axis = 1 --> axe des lignes 
data[data.isnull().any(axis=1)]

,date_operation,libelle,montant,solde_avt_ope,categ
107,2023-06-12,CARTE XX XX LES ANCIENS ROBINSON XX,NaN,4667.19,COURSES
156,2023-07-06,PRELEVEMENT XX TELEPHONE XX XX,-36.48,3295.68,NaN
269,2023-09-11,CARTE XX XX XX XX,NaN,3401.93,AUTRE

In [8]:
data.iloc[156,4]

nan

In [11]:
# trouver une valeur grâce à son index et sa catégorie
data.loc[156, 'categ'] = 'FACTURE TELEPHONE'

In [32]:
data['montant'].min()

-15000.0

In [33]:
data.loc[data['montant']== -15000,:]

    date_operation            libelle  montant  solde_avt_ope  categ
199     2023-08-03  CARTE XX XX XX XX -15000.0        3797.35  AUTRE

In [34]:
data.iloc[199:201,:]

,date_operation,libelle,montant,solde_avt_ope,categ
199,2023-08-03,CARTE XX XX XX XX,-15000.00,3797.35,AUTRE
200,2023-08-03,CARTE XX XX L'EPICERIE DEMBAS XX XX,-10.51,3782.96,AUTRE

In [35]:
data.iloc[199,2]=(data.iloc[200,3])-(data.iloc[199,3])

In [36]:
data.iloc[199:201,:]

,date_operation,libelle,montant,solde_avt_ope,categ
199,2023-08-03,CARTE XX XX XX XX,-14.39,3797.35,AUTRE
200,2023-08-03,CARTE XX XX L'EPICERIE DEMBAS XX XX,-10.51,3782.96,AUTRE

In [37]:
data['montant'].max()

1071.6

In [38]:
data.loc[data['montant']== 1071.6,:]

,date_operation,libelle,montant,solde_avt_ope,categ
181,2023-07-25,VIREMENT XX XX XX XX XX XX XX,1071.6,2307.08,AUTRE

In [39]:
data.iloc[181:183,:]

,date_operation,libelle,montant,solde_avt_ope,categ
181,2023-07-25,VIREMENT XX XX XX XX XX XX XX,1071.60,2307.08,AUTRE
182,2023-07-26,CARTE XX XX L'EPICERIE DEMBAS XX XX,-7.54,3378.68,AUTRE

In [40]:

data['solde_avt_ope'].max()

4709.31

In [41]:
data['solde_avt_ope'].min()

1416.81

In [54]:
data.head()

,date_operation,libelle,montant,solde_avt_ope,categ
0,2023-03-31,DON XX XX XX XX XX XX XX,-1.44,1515.25,AUTRE
1,2023-04-03,CARTE XX XX RAPT XX,-24.00,1513.81,TRANSPORT
2,2023-04-03,CARTE XX XX RAPT XX,-73.00,1489.81,TRANSPORT
3,2023-04-03,VIREMENT XX XX XX XX XX XX XX XX XX XX XX XX,676.00,1416.81,AUTRE
4,2023-04-03,VIREMENT XX XX XX XX XX XX,4.80,2092.81,AUTRE

In [55]:
data['montant']= round((data['montant']),2)

In [56]:
data['solde_avt_ope']= round((data['solde_avt_ope']),2)

In [58]:
data.columns

Index(['date_operation', 'libelle', 'montant', 'solde_avt_ope', 'categ'], dtype='object')

In [60]:
data[data.duplicated(data.columns)]
data.drop(index=44)

,date_operation,libelle,montant,solde_avt_ope,categ
0,2023-03-31,DON XX XX XX XX XX XX XX,-1.44,1515.25,AUTRE
1,2023-04-03,CARTE XX XX RAPT XX,-24.00,1513.81,TRANSPORT
2,2023-04-03,CARTE XX XX RAPT XX,-73.00,1489.81,TRANSPORT
3,2023-04-03,VIREMENT XX XX XX XX XX XX XX XX XX XX XX XX,676.00,1416.81,AUTRE
4,2023-04-03,VIREMENT XX XX XX XX XX XX,4.80,2092.81,AUTRE
...,...,...,...,...,...
304,2023-10-05,CARTE XX XX XX XX XX XX,-10.64,2440.94,AUTRE
305,2023-10-05,CARTE XX XX XX XX,-4.80,2430.30,AUTRE
306,2023-10-06,FORFAIT COMPTE SUPERBANK XX XX XX XX,-1.92,2425.50,COTISATION BANCAIRE
307,2023-10-06,CARTE XX XX CHEZ LUC XX,-10.00,2423.58,RESTAURANT
308,2023-10-06,PRELEVEMENT XX TELEPHONE XX XX,-13.58,2413.58,FACTURE TELEPHONE

In [68]:
data.drop(44, inplace=True)
data.iloc[35:50,:]

,date_operation,libelle,montant,solde_avt_ope,categ
35,2023-04-18,CARTE XX XX XX XX,-74.58,3783.86,AUTRE
36,2023-04-18,CARTE XX XX VELOC XX XX,-1.70,3709.28,TRANSPORT
37,2023-04-19,CARTE XX XX XX XX XX,-13.60,3707.58,AUTRE
38,2023-04-20,CARTE XX XX XX XX,-7.20,3693.98,AUTRE
39,2023-04-21,CARTE XX XX L'EPICERIE DEMBAS XX XX,-10.43,3686.78,AUTRE
40,2023-04-24,CARTE XX XX XX XX XX,-7.84,3676.35,AUTRE
41,2023-04-24,CARTE XX XX XX XX,-11.64,3668.51,AUTRE
42,2023-04-24,CARTE XX XX CHEZ LUC XX,-9.20,3656.87,RESTAURANT
43,2023-04-25,CARTE XX XX LES ANCIENS ROBINSON XX,-32.67,3647.67,COURSES
45,2023-04-26,CARTE XX XX XX XX XX XX,-10.00,3615.00,AUTRE
46,2023-04-26,CARTE XX XX LA LOUVE XX XX,-1.90,3605.00,COURSES
47,2023-04-28,CARTE XX XX LES ANCIENS ROBINSON XX,-9.11,3603.10,COURSES
48,2023-04-28,DON XX XX XX XX XX XX XX,-1.40,3593.99,AUTRE
49,2023-04-30,XX XX VIREMENT XX XX XX,-36.00,3592.59,AUTRE
50,2023-05-02,CARTE XX XX TOUPTIPRI XX,-12.24,3556.59,COURSES

In [43]:
print ("dimensions fichier : ", data.shape)

dimensions fichier :  (309, 5)

In [45]:
print (data.dtypes)

date_operation    datetime64[ns]
libelle                   object
montant                  float64
solde_avt_ope            float64
categ                     object
dtype: object

In [46]:
data.info

<bound method DataFrame.info of     date_operation                                       libelle  montant  \
0       2023-03-31                      DON XX XX XX XX XX XX XX    -1.44
1       2023-04-03                           CARTE XX XX RAPT XX   -24.00
2       2023-04-03                           CARTE XX XX RAPT XX   -73.00
3       2023-04-03  VIREMENT XX XX XX XX XX XX XX XX XX XX XX XX   676.00
4       2023-04-03                    VIREMENT XX XX XX XX XX XX     4.80
..             ...                                           ...      ...
304     2023-10-05                       CARTE XX XX XX XX XX XX   -10.64
305     2023-10-05                             CARTE XX XX XX XX    -4.80
306     2023-10-06          FORFAIT COMPTE SUPERBANK XX XX XX XX    -1.92
307     2023-10-06                       CARTE XX XX CHEZ LUC XX   -10.00
308     2023-10-06                PRELEVEMENT XX TELEPHONE XX XX   -13.58

     solde_avt_ope                categ
0          1515.25                AUTRE
1          1513.81            TRANSPORT
2          1489.81            TRANSPORT
3          1416.81                AUTRE
4          2092.81                AUTRE
..             ...                  ...
304        2440.94                AUTRE
305        2430.30                AUTRE
306        2425.50  COTISATION BANCAIRE
307        2423.58           RESTAURANT
308        2413.58    FACTURE TELEPHONE

[309 rows x 5 columns]>

In [69]:
operation_modifiee = data
import os 
operation_modifiee.to_csv('D:\Dev\Mes fichiers Python\Fichiers de données\operation_modifiee.csv')